[
    {
    "name": "Aboleth",
    "type": "Large aberration, lawful evil",
    "allignment": "lawful evil",
    "armor_class": 17,
    "armor_type":"Natural Armor",
    "hp": 135,
    "hit-dice": "18d10 + 36",
    "speed": {
        "walking": 10,
        "swimming": 40,
        "flying":0,
        "climbing":0
    },
    "stats":{
        "str":21,
        "str_mod": 5,
        "dex": 9,
        "dex_mod": -1,
        "con": 15,
        "con_mod": 2,
        "int": 18,
        "int_mod": 4,
        "wis": 15,
        "wis_mod": 2,
        "cha": 18,
        "cha_mod": 4
    },
    "saving_throws":
    {
        "con": 6, 
        "int": 8, 
        "wis": 6
    }, 
    "skills":
    {
        "History": 12, 
        "Perception": 10
    },
    "senses":{
        "darkvision": 120,
        "Passive Perception": 20
    }, 
    "languages": {
        "languages": ["Deep Speech"], 
        "telepathy": 120
    },
    "cr": 10,
    "xp":5900,
    "traits": {
        "amphibious": "The aboleth can breathe air and water.",
        "mucous_cloud": "While underwater, the aboleth is surrounded by transformative mucus. A creature that touches the aboleth or that hits it with a melee attack while within 5 feet of it must make a DC 14 Constitution saving throw. On a failure, the creature is diseased for 1d4 hours. The diseased creature can breathe only underwater. </p><p><em><strong>",
        "probing_telepathy": "If a creature communicates telepathically with the aboleth, the aboleth learns the creature's greatest desires if the aboleth can see the creature"
    },
    "actions":{
        "multiattack": "The aboleth makes three tentacle attacks.",
        "tentacle": "Melee Weapon Attack: +9 to hit, reach 10 ft., one target. Hit: 12 (2d6 + 5) bludgeoning damage. If the target is a creature, it must succeed on a DC 14 Constitution saving throw or become diseased. The disease has no effect for 1 minute and can be removed by any magic that cures disease. After 1 minute, the diseased creature's skin becomes translucent and slimy, the creature can't regain hit points unless it is underwater, and the disease can be removed only by heal or another disease-curing spell of 6th level or higher. When the creature is outside a body of water, it takes 6 (1d12) acid damage every 10 minutes unless moisture is applied to the skin before 10 minutes have passed.",
        "tail": "Melee Weapon Attack: +9 to hit, reach 10 ft. one target. Hit: 15 (3d6 + 5) bludgeoning damage.", 
        "enslave": "(3/Day). The aboleth targets one creature it can see within 30 feet of it. The target must succeed on a DC 14 Wisdom saving throw or be magically charmed by the aboleth until the aboleth dies or until it is on a different plane of existence from the target. The charmed target is under the aboleth's control and can't take reactions, and the aboleth and the target can communicate telepathically with each other over any distance. Whenever the charmed target takes damage, the target can repeat the saving throw. On a success, the effect ends. No more than once every 24 hours, the target can also repeat the saving throw when it is at least 1 mile away from the aboleth."
    },
    "legendary_actions":{
        "text": "The aboleth can take 3 legendary actions, choosing from the options below. Only one legendary action option can be used at a time and only at the end of another creature's turn. The aboleth regains spent legendary actions at the start of its turn.",
        "detect": "The aboleth makes a Wisdom (Perception) check.",
        "tail_swipe": "The aboleth makes one tail attack.",
        "psychic_drain": "(Costs 2 Actions). One creature charmed by the aboleth takes 10 (3d6) psychic damage, and the aboleth regains hit points equal to the damage the creature takes."
    },
    "description": "Before the coming of the gods, aboleths lurked in primordial oceans and underground lakes. They reached out with their minds and seized control of the burgeoning life-forms of the mortal realm. Their dominance made them like gods. Then the true gods appeared, smashing the aboleths’ empire. Aboleths have never forgotten. Eternal Memories. Aboleths have flawless memories. They pass on their knowledge and experience from generation to generation. Thus, the injury of their defeat by the gods remains perfectly preserved in their minds. Aboleths’ minds are treasure troves of ancient lore, recalling moments from prehistory with perfect clarity. They plot patiently and intricately across eons. Few creatures can conceive of the extent of an aboleth’s plan. Gods in the Lake. Aboleths dwell in watery environments, including ocean abysses, deep lakes, and the Elemental Plane of Water. In these domains and the lands that adjoin them, aboleths are like gods, demanding worship and obedience from their subjects. When they consume other creatures, aboleths add the knowledge and experiences of their prey to their eternal memories. Aboleths use their telepathic powers to read the minds of creatures and know their desires. An aboleth uses this knowledge to gain a creature’s loyalty, promising to fulfill such wants in exchange for obedience. Within its lair, the aboleth can further use its powers to override senses, granting creatures, such as its followers, the illusion of promised rewards. Enemies of the Gods. The aboleths’ fall from power is written in stark clarity on their flawless memories, for aboleths never truly die. If an aboleth’s body is destroyed, its spirit returns to the Elemental Plane of Water, where a new body coalesces for it over days or months. Ultimately, aboleths dream of overthrowing the gods and regaining control of the world. Aboleths have had untold eons to plot and to prepare their plans for perfect execution.",
    "image": "https://media-waterdeep.cursecdn.com/avatars/thumbnails/0/11/1000/1000/636238825975375671.jpeg"
  }
]